#Использовать autumn
#Использовать autumn-cli
#Использовать autumn-logos

#Использовать "."
#Использовать "../core"

Настройки = Новый Соответствие();
Настройки.Вставить("cli.ИмяПриложения", "mutatos");
Настройки.Вставить("cli.ПолноеИмяПриложения", "Мутационное тестирование для OneScript");
Настройки.Вставить("cli.ВерсияПриложения", "0.1.0");

СоветДругогоМастера = Новый СоветДругогоМастера()
	.ЗначенияДеталек(Настройки);

Поделка = Новый Поделка(СоветДругогоМастера);
Поделка.ЗапуститьПриложение();
