#Использовать "../internal"

// Меняет булевы литералы местами: Истина на Ложь и обратно.

Перем _Замены;

Функция Имя() Экспорт
	Возврат "БулевыЛитералы";
КонецФункции

Функция ТипыУзлов(Типы) Экспорт
	Результат = Новый Массив();
	Результат.Добавить(Типы.ВыражениеЛитерал);
	Возврат Результат;
КонецФункции

Функция Мутации(Узел, Контекст) Экспорт

	Мутации = Новый Массив();

	Замена = _Замены.Получить(Узел.Вид);
	Если Замена = Неопределено Тогда
		Возврат Мутации;
	КонецЕсли;

	ИсходныйТекст = Контекст.ТекстТокена(Узел.Начало);

	Мутации.Добавить(Контекст.МутацияТокена(
		Имя(),
		Узел.Начало,
		Замена,
		СтрШаблон("%1 заменено на %2", ИсходныйТекст, Замена)));

	Возврат Мутации;

КонецФункции

&Мутатор
Процедура ПриСозданииОбъекта(&Пластилин Токены)

	_Замены = Новый Соответствие();
	_Замены.Вставить(Токены.Истина, "Ложь");
	_Замены.Вставить(Токены.Ложь, "Истина");

КонецПроцедуры
